Table of Contents
 Class OpenObject
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Open object base class POS - class can not be abstract -it causes problems with serialization
[DataContract]
public class OpenObject
Inheritance
object
OpenObject
Derived
CalculationSetup
StagesLoading
ProjectDataConcrete
TimeAxis
TimePoint
CssComponent
Parameter
ReinforcedBar
Stirrup
TendonBar
TendonDuct
LoadBase
Point2D
Polygon2D
PolyLine2D
Region2D
Segment2D
Vector2D
CoordSystem
Polygon3D
Vector3D
CombiItem
CrossSectionComponentEdges
MaterialStrength
MaterialStrengthProperty
OpenMessage
DesignMemberInSubStructure
RebarHookBase
RebarPolyLine3D
RebarSegment3DBase
SubStructureGeometry
SubStructureLoading
OpenAttribute
OpenElementId
OriginSettings
ProjectData
ProjectDataEc
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page